<?php
/**
 * 错误码以及错误信息配置定义
 */
return array(
	'errorinfo'=>array(
	    '10000' => 'success',

        //基础错误
        '10001'=>'尚未登录',//用户尚未登录
        '10002'=>'permission_denied',//无权访问
        '10003'=>'data_empty',

		//上传视频相关

        '10100' => '插入视频信息错误',
        '10101' => '保存文件失败，请重试',
        '10102' => '存在相同名称文件，请更改文件名称',
        '10103' => '该文件不合法，请重新检查',
        '10104' => '该文件格式不正确，请重新检查',

        //管理用户相关
        '10200'=>'parmas_not_null',
        '10201'=>'member_add_fail',

        //admin

        //权限
//        '10120'=>'access_denied',

        '1001'=>'parmas_not_null',
		'1002'=>'parmas_null',
		'1003'=>'traceinfo_not_null',
		'1004'=>'mobile_deviceid_not_match',
		'1005'=>'token_not_null',
		'1006'=>'token_has_expired',
		'1007'=>'sign_error',



        /*
         * home相关
         *
         */
		

        '11001'=>'所属单位不存在',
        '11002'=>'Email地址不合法',
        '11003'=>'手机号码不合法',
        '11004'=>'注册失败，请联系管理员或者重试',
        '11005'=>'登录失败，用户名或密码错误',
        '11006'=>'暂无数据',
        '11007'=>'验证码错误',
        '11009'=>'确认密码错误',
        '11010'=>'该邮箱已经注册，请尝试其他邮箱',
        '11011'=>'用户名密码错误，请重试',
        '11012'=>'新密码和确认密码不一致',
        '11013'=>'修改失败，请重试',
        '11014'=>'参数不能为空',
        '11015'=>'暂无数据',
        '11016'=>'操作失败',

	),
	
);